#+title: File-based Blog Management with ox-hugo
#+date: <2022-11-15 Tue 09:58>
#+hugo_lastmod: <2022-11-15 Tue 09:58>
#+hugo_tags: emacs org ox-hugo hugo
#+setupfile: ./blog.conf

* Folder structure
My folder structure finally looks like this.

#+begin_src shell :results output :dir ../ :exports results :eval no-export
tree --dirsfirst
#+end_src

#+RESULTS:
#+begin_example
.
├── coding
│   ├── post1.org
│   ├── post2.org
│   ├── post3.org
│   └── blog.conf
├── emacs
│   ├── post1.org
│   ├── post2.org
│   ├── post3.org
│   └── blog.conf
├── linux
│   ├── post1.org
│   ├── post2.org
│   ├── post3.org
│   └── blog.conf
├── tech
│   ├── post1.org
│   ├── post2.org
│   ├── post3.org
│   └── blog.conf
├── blog.conf
├── hugo-pages.org
└── ox-hugo-export.el
#+end_example

